In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('https://www.dropbox.com/s/kdodxs0a0z153x6/avocado.csv?dl=1')

In [ ]:
df.drop('Unnamed: 0', axis = 1, inplace = True)

In [ ]:
df.reset_index(drop = True, inplace = True)

In [ ]:
df

             Date  AveragePrice  ...  year            region
0      2015-12-27          1.33  ...  2015            Albany
1      2015-12-20          1.35  ...  2015            Albany
2      2015-12-13          0.93  ...  2015            Albany
3      2015-12-06          1.08  ...  2015            Albany
4      2015-11-29          1.28  ...  2015            Albany
...           ...           ...  ...   ...               ...
18244  2018-02-04          1.63  ...  2018  WestTexNewMexico
18245  2018-01-28          1.71  ...  2018  WestTexNewMexico
18246  2018-01-21          1.87  ...  2018  WestTexNewMexico
18247  2018-01-14          1.93  ...  2018  WestTexNewMexico
18248  2018-01-07          1.62  ...  2018  WestTexNewMexico

[18249 rows x 13 columns]

In [ ]:
df.shape

(18249, 13)

In [ ]:
df.columns

Index(['Date', 'AveragePrice', 'Total Volume', '4046', '4225', '4770',
       'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year',
       'region'],
      dtype='object')

In [ ]:
df.columns.values

array(['Date', 'AveragePrice', 'Total Volume', '4046', '4225', '4770',
       'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'], dtype=object)

In [ ]:
df.head(3)

         Date  AveragePrice  Total Volume  ...          type  year  region
0  2015-12-27          1.33      64236.62  ...  conventional  2015  Albany
1  2015-12-20          1.35      54876.98  ...  conventional  2015  Albany
2  2015-12-13          0.93     118220.22  ...  conventional  2015  Albany

[3 rows x 13 columns]

In [ ]:
df.tail()

             Date  AveragePrice  Total Volume  ...     type  year            region
18244  2018-02-04          1.63      17074.83  ...  organic  2018  WestTexNewMexico
18245  2018-01-28          1.71      13888.04  ...  organic  2018  WestTexNewMexico
18246  2018-01-21          1.87      13766.76  ...  organic  2018  WestTexNewMexico
18247  2018-01-14          1.93      16205.22  ...  organic  2018  WestTexNewMexico
18248  2018-01-07          1.62      17489.58  ...  organic  2018  WestTexNewMexico

[5 rows x 13 columns]

In [ ]:
df.sample(5)

             Date  AveragePrice  Total Volume  ...          type  year        region
13422  2016-05-08          2.00      39638.67  ...       organic  2016       NewYork
13011  2016-04-03          1.66       3632.75  ...       organic  2016  Jacksonville
15169  2017-12-03          1.75      32233.21  ...       organic  2017       Chicago
3524   2016-03-20          1.09     371639.10  ...  conventional  2016       Detroit
7544   2017-08-13          1.71     432923.79  ...  conventional  2017      Portland

[5 rows x 13 columns]

In [ ]:
from google.colab import drive
drive.mount('drive')

Mounted at drive

In [ ]:
import os

In [ ]:
fpath = 'drive/MyDrive/MKTG 3509/'
os.listdir(fpath)

['Module 1.ipynb',
 'Assignment 1',
 'A1 Tyler Sunday.ipynb',
 'module 2.ipynb',
 'A2 Tyler Sunday.ipynb',
 'Copy of Copy of avocado.xlsx',
 'Copy of avocado.json',
 'avocado.csv',
 'Module 3.ipynb']

In [ ]:
df = pd.read_cvs(fpath + 'avocado.csv')

AttributeError: ignored